Revit 2027 API
DeleteWorksetOption Enumeration
 This class defines an enumerative type used to specify the option to delete a workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DeleteWorksetOption
Public Enumeration DeleteWorksetOption
public enum class DeleteWorksetOption
type DeleteWorksetOption
Members
Member name | Value | Description
DeleteAllElements | 1 |  Delete a workset together with all the elements in this workset.
MoveElementsToWorkset | 0 |  Delete a workset, while moving the elements from the deleted workset to another workset.
See Also
Reference
Autodesk.Revit.DB Namespace